app/controllers/microposts_controller.rb

SELECT * FROM `microposts` ORDER BY created_at DESC
---
  def index
    @microposts = Micropost.all

SELECT * FROM `microposts` WHERE (`microposts`.`id` = 3) ORDER BY created_at DESC
---
  def show
    @micropost = Micropost.find(params[:id])

INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES('Bloody hell. Are those spiders? What can\'t it be butterflies?', 3, '2015-04-10 06:08:09', '2015-04-10 06:08:09')
---
  def create
    @micropost = Micropost.new(params[:micropost])

    respond_to do |format|
      if @micropost.save

SELECT * FROM `microposts` WHERE (`microposts`.`id` = 9) ORDER BY created_at DESC
DELETE FROM `microposts` WHERE `id` = 9
---
  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy