app/controllers/users_controller.rb

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def index
    @title = "All Users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM `users` LIMIT 0, 30
SELECT count(*) AS count_all FROM `users`

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 23)
SELECT * FROM `microposts` WHERE (`microposts`.user_id = 2) ORDER BY created_at DESC LIMIT 30, 30
SELECT count(*) AS count_all FROM `microposts` WHERE (`microposts`.user_id = 2)

  def create
    @user = User.new(params[:user])
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `encrypted_password`, `salt`, `password`, `remember_token`, `admin`) VALUES('Teju', 'tejaswini@gmail.com', '2015-04-10 13:15:35', '2015-04-10 13:15:35', NULL, 'bd1d4dc8bb6a75d65955b7290c220955d757ef9f5740171e2a1b2190d4509f37', 'tejusiva', NULL, 0)

  def update
    # @user = User.find(params[:id])
     if @user.update_attributes(params[:user])
---
UPDATE `users` SET `password` = 'asdfh123456', `salt` = '683c806ae5c3c50705c55525ec6f50be1b2b39d068adf6b02c3f5715d7048091', `updated_at` = '2015-04-03 06:05:13' WHERE `id` = 27